CSI API ETABS v1

# cSapModelGroupDef Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cGroup GroupDef { get; }

    ReadOnly Property GroupDef As cGroup
    	Get

    Dim instance As cSapModel
    Dim value As cGroup

    value = instance.GroupDef

    property cGroup^ GroupDef {
    	cGroup^ get ();
    }

    abstract GroupDef : cGroup with get

#### Property Value

Type: cGroup

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com